# В игре «Битва карт» карточная колода раздается поровну двум игрокам, карты выдаются в случайном порядке.
# Игроки вскрывают по одной верхней карте, и тот, чья карта старше, забирает обе вскрытые карты
# и помещает их вниз своей колоды. Игрок, который остался без карт, проигрывает.
# Все карты в колоде различны по номиналу, старшая карта побеждает младшую.
# Игрок, который забирает карты, кладет сначала карту другого игрока, затем свою карту вниз своей колоды.
# Напишите программу, которая моделирует игру «Битва карт» и определяет победителя.
# В игре участвуют 10 карт со значениями от 0 до 9. Большая карта побеждает меньшую,
# карта со значением 0 побеждает карту 9 (и только ее).
# Программа получает на вход две строки: первая строка содержит 5 чисел,
# которые разделены пробелами, — номера карт первого игрока, вторая строка — 5 карт второго игрока.
# Карты перечислены сверху вниз, то есть каждая строка начинается с карты, которая будет открыта первой.
# Программа должна определить победителя при данной раздаче и вывести слово "first" или "second",
# а также количество ходов до выигрыша. Если игра не заканчивается за 100 ходов, между игроками ничья,
# программа должна вывести слово "tie". Для решения задачи используйте очередь.
# Например, на вход программы передали две строки чисел: 1 3 5 7 9 и 2 4 6 8 0.
# В таком случае второй игрок победит первого за 5 ходов. Программа должна вернуть ответ second 5.

def card_game(player1, player2):

    # Преобразовываем строку с числами в список с числами
    player1 = [int(x) for x in player1.split()]
    player2 = [int(x) for x in player2.split()]

    # Игровой цикл
    for i in range(100):

        # Проверка продолжаем ли игру:
        # Если у первого игрока не осталось карт
        if not player1:
            return f'second {i}'

        # Если у второго игрока не осталось карт
        if not player2:
            return f'first {i}'

        # Берем по первой карте у каждого игрока
        card1 = player1.pop(0)
        card2 = player2.pop(0)

        
        if (card1 > card2 and not (card2 == 0 and card1 == 9)) or (card1 == 0 and card2 == 9):
            player1.append(card2)
            player1.append(card1)
        else:
            player2.append(card1)
            player2.append(card2)

    return 'tie'