# Напишите функцию graph_check, которая проверяет, является ли заданный неориентированный граф связным.
# Связный граф — это такой граф, в котором существует путь между любыми двумя его вершинами.
# То есть из одной его вершины можно добраться до любой другой. Граф задается списком ребер.
# На вход программы три аргумента. Два числа — количество вершин графа V и количество ребер E.
# Третий аргумент — список длиной E, где каждый элемент — это кортеж из двух чисел u и v.
# Число u — это номер вершины, из которой ребро выходит. Число v — номер вершины, в которую ребро приходит.
# Программа должна вернуть ответ YES, если граф является связным, и NO в любом ином случае.
# Используйте DFS для решения задачи.
# Сохраните ребра графа в многомерный список. Каждый элемент такого списка — это две вершины, которые составляют ребро.


# Например: edges = [(1, 2), (1, 4), (2, 3)] - это список из кортежей.
# Кортежи это две вершины, соединенные ребром или же ребра. (1, 2) - ребро и т. д.

def graph_check (V, E, edges):

    # Создаем список смежности. Изначально он содержит пустые списки в количестве вершин V
    # Индексы списка - это номера вершин
    # Элементы списка - вложенные списки, в которые добавим всех соседей данной вершины,
    # то есть те вершины, с которыми вершина имеет связь (общие ребра)

    adj = [[] for _ in range(V)]

    # для этого переберем весь список edges
    for u, v in edges:

        # Граф неориентированный, поэтому добавляем элементы в обоих направлениях
        adj[u].append(v) # В список adj во вложенный список с индексом u добавить эдемент v
        adj[v].append(u) # В список adj во вложенный список с индексом v добавить эдемент u
        # В результате получим adj = [[2, 4], [1, 3], [2], [1]]
        # Т. е первая вершина связана с 2 и 4, вторая с 1 и 3, третья со 2 и четвертая с 1

    # Создаем массив для отслеживания посещенных вершин
    visited = [False] * V

    # Функция DFS (поиск в глубину) для обхода графа:
    def dfs(vertex):
        visited[vertex] = True

        # перебираем соседей каждой из вершин
        for neighbor in adj[vertex]:

            # если соседняя вершина не посещена, снова вызываем функцию dfs для ее обхода,
            # обход предыдущей вершины ставим на паузу
            if not visited [neighbor]:

                # дальше значение необойденной вершины передается на вход dfs
                # значение переменной neighbor подается на вход dfs и становится значением параметра vertex
                dfs(neighbor)

    # Запускаем DFS из вершины 0 (если граф не пустой)
    if  V > 0:
        dfs(0)

    # Проверяем, все ли вершины были посещены
    # Если хотя бы одна вершина осталась непосещенной - граф несвязный
    if all (visited):
        return 'YES'
    else:
        return 'NO'
    


