# Напишите программу, которая будет считывать содержимое файла, добавлять к считанным
# строкам порядковый номер и сохранять их в таком виде в новом файле
# Каждая строка в созданном файле должна начинаться с ее номера, двоеточия и пробела
# после чего должен идти текст строки из исходного файла.

# Открываем для добавления данных файл file_new, в котором будем записывать строки с порядковыми номерами
file_new =  open('../Test/test5.txt', 'a', encoding='utf-8')

# Открываем для чтения файл в котором нужно пронумеровать строки
with open('../Test/test4.txt', 'r', encoding='utf-8') as file:

    # Читаем файл построчно. Строка заканчивается переходом \n. Ввозвращаемое значение - список из строк.
    file_splitted = file.readlines()
    print(file_splitted)

    for i, el in enumerate(file_splitted):

        # Добавляем в новый файл построчно: порядковый номер, двоеточие, пробел и строку el с помощью конкатенации
        file_new.write(str(i+1) + ': ' + el)

file_new.close()
