# Дана строка, которая состоит из круглых скобок. Создайте функцию row_check, которая определит, какое наименьшее
# количество символов необходимо удалить из этой строки, чтобы получилась правильная скобочная последовательность.
# Правильная скобочная последовательность — это строка, в которой каждая открывающая скобка имеет соответствующую
# закрывающую скобку и скобки правильно вложены. Например, правильные скобочные последовательности могут выглядеть
# так: (), (()), (()(())). Неправильные скобочные последовательности выглядят так: (, ), ((), ())(.
# На вход программы передается строка из круглых скобок. Длина строки не превосходит 100 символов.
# Функция row_check должна вернуть одно число — минимальное количество символов, которые необходимо удалить.
# Используйте стек для решения задачи.



def row_check(text):

    # Считает октрытые скобки (стэк)
    count_open = 0

    # Считает скобки, ктороые нужно удалить
    count_del = 0

    # Идем по строке
    for el in text:

        # Если встретили открывающиюся скобку
        if el == '(':

            # Увеличиваем значение счетчика на 1 (помещаем открытую скобку в стэк)
            count_open += 1

        # Если встретили закрывающую скобку
        elif el == ')':

            # Проверяем есть ли на данный момент открывающая, но не закрытая
            if count_open > 0:

                # Если есть, уменьшаем значение счетчика на 1 (удаляем скобку из стэка)
                count_open -= 1

            # Если открытых скобок нет, тогда закрывающую скобку нужно удалять - увеличиваем значение счетчика
            # закрывающих скобок которые нужно удалить
            else:
                count_del += 1

    # Складываем закрывающие скобки, которые нужно удалить,
    # с открытыми скобками (в строке text они будут в самом конце)
    return count_open + count_del